"""
Помилки (номери рядків через пробіл, цей рядок - №2): 14 15 23
"""


def f(x):
    """Повернути значення функції.

    Функція не обробляє винятки.
    """
    return x**2 / (x + 2) - 3

try:
    k = int(input("Введіть межу інтервалу [-k; k]: "))
    h = float(input("Введіть крок: "))

    x = -k
    print("x".rjust(10), "f(x)".rjust(10))
    while x <= k:
    # Якщо помилка виникає під час обчислення функції,
    # Необхідно вивести тире "-"
    # Цей випадок повинен обробити другий вкладений блок try
        try:
            print(f"{x:10.2f} {f(x):10.2f}")
        except ZeroDivisionError:
            print(f"{x:10.2f}", "-".rjust(10))

        x += h
except ValueError as exc:
    print("Введите целое число", exc)
except Exception as exc:
    print("Непонятная ошибка:", f"{exc.__class__}")
    
 
# --------------
# Приклад роботи:
#
# Введіть межу інтервалу [-k; k]: 5
# Введіть крок: 0.5
#          x       f(x)
#      -5.00     -11.33
#      -4.50     -11.10
#      -4.00     -11.00
#      -3.50     -11.17
#      -3.00     -12.00
#      -2.50     -15.50
#      -2.00          -
#      -1.50       1.50
#      -1.00      -2.00
#       ...
#       4.50       0.12
#       5.00       0.57


"""
Помилки (номери рядків через пробіл, цей рядок - №2): !!!
"""


def f(x):
    """Повернути значення функції.

    Функція не обробляє винятки.
    """
    return x**2 / (x + 2) - 3


k = int(input("Введіть межу інтервалу [-k; k]: "))
h = float(input("Введіть крок: "))

x = -k
print("x".rjust(10), "f(x)".rjust(10))
while x <= k:
    # Якщо помилка виникає під час обчислення функції,
    # Необхідно вивести тире "-"
    # Цей випадок повинен обробити другий вкладений блок try
    print(f"{x:10.2f} {f(x):10.2f}")

    x += h

 
# --------------
# Приклад роботи:
#
# Введіть межу інтервалу [-k; k]: 5
# Введіть крок: 0.5
#          x       f(x)
#      -5.00     -11.33
#      -4.50     -11.10
#      -4.00     -11.00
#      -3.50     -11.17
#      -3.00     -12.00
#      -2.50     -15.50
#      -2.00          -
#      -1.50       1.50
#      -1.00      -2.00
#       ...
#       4.50       0.12
#       5.00       0.57
